Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (32, 55, 55, 96)          34944     
_________________________________________________________________
re_lu (ReLU)                 (32, 55, 55, 96)          0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (32, 27, 27, 96)          0         
_________________________________________________________________
batch_normalization (BatchNo (32, 27, 27, 96)          384       
_________________________________________________________________
conv2d_1 (Conv2D)            (32, 27, 27, 256)         614656    
_________________________________________________________________
re_lu_1 (ReLU)               (32, 27, 27, 256)         0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (32, 13, 13, 256)         0         
_________________________________________________________________
batch_normalization_1 (Batch (32, 13, 13, 256)         1024      
_________________________________________________________________
conv2d_2 (Conv2D)            (32, 13, 13, 384)         885120    
_________________________________________________________________
re_lu_2 (ReLU)               (32, 13, 13, 384)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (32, 13, 13, 384)         1327488   
_________________________________________________________________
re_lu_3 (ReLU)               (32, 13, 13, 384)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (32, 13, 13, 256)         884992    
_________________________________________________________________
re_lu_4 (ReLU)               (32, 13, 13, 256)         0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (32, 6, 6, 256)           0         
_________________________________________________________________
flatten (Flatten)            (32, 9216)                0         
_________________________________________________________________
dense (Dense)                (32, 4096)                37752832  
_________________________________________________________________
re_lu_5 (ReLU)               (32, 4096)                0         
_________________________________________________________________
dropout (Dropout)            (32, 4096)                0         
_________________________________________________________________
dense_1 (Dense)              (32, 4096)                16781312  
_________________________________________________________________
re_lu_6 (ReLU)               (32, 4096)                0         
_________________________________________________________________
dropout_1 (Dropout)          (32, 4096)                0         
_________________________________________________________________
dense_2 (Dense)              (32, 10)                  40970     
=================================================================
Total params: 58,323,722
Trainable params: 58,323,018
Non-trainable params: 704
_________________________________________________________________
